//errorCode定义
angular.module('app').service('error', function() {


    //定义错误类型
    // this.type = {
    //     min: 1,
    //     max: 2,
    //     minlength: 3,
    //     maxlength: 4,
    //     required: 5,
    //     pattern: 6,
    //     romoteuniquecheck: 7,
    //     url: 8,
    //     email: 9,
    //     number: 10
    // };
    //定义错误代码
    this.code = {
        //默认错误代码
        '101': '值太小',
        '102': '值太大',
        '103': '长度过短',
        '104': '长度过长',
        '105': '请填写此字段',
        '106': '不正确的格式',
        '107': '已存在相同名称的字段',
        '108': '输入格式不正确！',
        '109': '邮箱格式不正确！',
        '110': '请输入数值！',

        //自定义错误代码
        '201': '请填写正确格式的域名',
        '202': '请填写正确格式的邮箱',
        '203': '请填写正确格式的IP',
        '204': '请填写正确的数值',
        '205': '请填写正确的url',
    };
});